# -*- coding: utf-8 -*-

"""
@author: Sword
@email: 173963781@qq.com
@file: h4.py
@time: 2022/11/15 17:20
"""

# 请问下面代码有没有毛病，为什么？
"""
input = "I love FishC.com"
print(input)
I love FishC.com
"""
# 应该不会报错，但是 变量 input 占用了常量

# 请问下面代码为什么会出错，应该如何解决？
r"""
print("C:\Useur\goodb\Desktop")
SyntaxError: (unicode error) 'unicodeescape' codec can't decode bytes in position 2-3: truncated \UXXXXXXXX escape
"""
# 在字符串前加上原始字符 r

# 如果要为一个函数写说明文档，那么你觉得应该使用哪种字符串比较合适？
# 三引号

# 请问是'123'大还是'256'?
# 字符无法比较，但实际操作时发现，'256'大，难道会自动转换为数字吗

# 请写出下面几个表达式的结果
# '123' + 256       报错，字符不能跟数字
# '123' + '256'     '123256'
# '123' * 3         '123123123'
# '123' - '12'      报错，字符之间不能相减

if __name__ == '__main__':
    fishc = """
      ___                     ___          ___          ___     
     /\  \         ___       /\  \        /\__\        /\  \    
    /::\  \       /\  \     /::\  \      /:/  /       /::\  \   
   /:/\:\  \      \:\  \   /:/\ \  \    /:/__/       /:/\:\  \  
  /::\~\:\  \     /::\__\ _\:\~\ \  \  /::\  \ ___  /:/  \:\  \ 
 /:/\:\ \:\__\ __/:/\/__//\ \:\ \ \__\/:/\:\  /\__\/:/__/ \:\__\
 \/__\:\ \/__//\/:/  /   \:\ \:\ \/__/\/__\:\/:/  /\:\  \  \/__/
      \:\__\  \::/__/     \:\ \:\__\       \::/  /  \:\  \      
       \/__/   \:\__\      \:\/:/  /       /:/  /    \:\  \     
                \/__/       \::/  /       /:/  /      \:\__\    
                             \/__/        \/__/        \/__/
    """

    print(fishc)

    # 打印一个九九乘法表
    for i in range(1, 10):
        for j in range(1, i + 1):
            print("{} x {} = {}\t".format(i, j, i * j), end=" ")
        print()
